---
kind: other
id: Methods.T:Autodesk.Revit.DB.BRepBuilderGeometryId
source: html/efa57f52-abbb-bb8c-2892-4575c675314c.htm
---
# BRepBuilderGeometryId Methods

Returns an invalid BRepBuilderGeometryId, used as a return value to indicate an error.